IsAssemblyView Property
 Indicates if the view is assembly view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public bool IsAssemblyView { get; }
  Visual Basic
Public ReadOnly Property IsAssemblyView As Boolean
	Get
  Visual C++
public:
property bool IsAssemblyView {
	bool get ();
}
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →